RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM5300/ip/hpm_mmc_regs.h
/*
 * INI_BR0_POS_REQ (RW)
 *
 * Auto clear. Only effective in open_loop mode.
 */
#define MMC_CR_INI_BR0_POS_REQ_MASK (0x20000000UL)
#define MMC_CR_INI_BR0_POS_REQ_SHIFT (29U)
#define MMC_CR_INI_BR0_POS_REQ_SET(x) (((uint32_t)(x) << MMC_CR_INI_BR0_POS_REQ_SHIFT) & MMC_CR_INI_BR0_POS_REQ_MASK)
#define MMC_CR_INI_BR0_POS_REQ_GET(x) (((uint32_t)(x) & MMC_CR_INI_BR0_POS_REQ_MASK) >> MMC_CR_INI_BR0_POS_REQ_SHIFT)

/*
 * INI_BR1_POS_REQ (RW)
 *
 * Auto clear. Only effective in open_loop mode.
 */
#define MMC_CR_INI_BR1_POS_REQ_MASK (0x10000000UL)
#define MMC_CR_INI_BR1_POS_REQ_SHIFT (28U)
#define MMC_CR_INI_BR1_POS_REQ_SET(x) (((uint32_t)(x) << MMC_CR_INI_BR1_POS_REQ_SHIFT) & MMC_CR_INI_BR1_POS_REQ_MASK)
#define MMC_CR_INI_BR1_POS_REQ_GET(x) (((uint32_t)(x) & MMC_CR_INI_BR1_POS_REQ_MASK) >> MMC_CR_INI_BR1_POS_REQ_SHIFT)

/*
 * FRCACCELZERO (RW)
 *
 * Zeroise the accelerator calculation.
 */
#define MMC_CR_FRCACCELZERO_MASK (0x8000000UL)
#define MMC_CR_FRCACCELZERO_SHIFT (27U)
#define MMC_CR_FRCACCELZERO_SET(x) (((uint32_t)(x) << MMC_CR_FRCACCELZERO_SHIFT) & MMC_CR_FRCACCELZERO_MASK)
#define MMC_CR_FRCACCELZERO_GET(x) (((uint32_t)(x) & MMC_CR_FRCACCELZERO_MASK) >> MMC_CR_FRCACCELZERO_SHIFT)

/*
 * MS_COEF_EN (RW)
 *
 * Multiple Coefficients Enable
 */
#define MMC_CR_MS_COEF_EN_MASK (0x4000000UL)
#define MMC_CR_MS_COEF_EN_SHIFT (26U)
#define MMC_CR_MS_COEF_EN_SET(x) (((uint32_t)(x) << MMC_CR_MS_COEF_EN_SHIFT) & MMC_CR_MS_COEF_EN_MASK)
#define MMC_CR_MS_COEF_EN_GET(x) (((uint32_t)(x) & MMC_CR_MS_COEF_EN_MASK) >> MMC_CR_MS_COEF_EN_SHIFT)

/*
 * INI_DELTA_POS_TRG_TYPE (RW)
 *
 * 0: Time Stamp in the configuration
 * 1: Risedge of In Trg[0]
 * 2: Risedge of In Trg[1]
 * 3: Risedge of out trg[0]
 * 4: Risedge of out trg[1]
 * 5: triggered by self position trigger
 * 6: triggered by self speed trigger
 * Otherser: no function
 */
#define MMC_CR_INI_DELTA_POS_TRG_TYPE_MASK (0x3800000UL)
#define MMC_CR_INI_DELTA_POS_TRG_TYPE_SHIFT (23U)
#define MMC_CR_INI_DELTA_POS_TRG_TYPE_SET(x) (((uint32_t)(x) << MMC_CR_INI_DELTA_POS_TRG_TYPE_SHIFT) & MMC_CR_INI_DELTA_POS_TRG_TYPE_MASK)
#define MMC_CR_INI_DELTA_POS_TRG_TYPE_GET(x) (((uint32_t)(x) & MMC_CR_INI_DELTA_POS_TRG_TYPE_MASK) >> MMC_CR_INI_DELTA_POS_TRG_TYPE_SHIFT)

/*
 * INI_POS_TRG_TYPE (RW)
 *
 * 0: Time Stamp in the configuration
 * 1: Risedge of In Trg[0]
 * 2: Risedge of In Trg[1]
 * 3: Risedge of out trg[0]
 * 4: Risedge of out trg[1]
 * 5: triggered by self position trigger
 * 6: triggered by self speed trigger
 * Otherser: no function
 */
#define MMC_CR_INI_POS_TRG_TYPE_MASK (0x700000UL)
#define MMC_CR_INI_POS_TRG_TYPE_SHIFT (20U)
#define MMC_CR_INI_POS_TRG_TYPE_SET(x) (((uint32_t)(x) << MMC_CR_INI_POS_TRG_TYPE_SHIFT) & MMC_CR_INI_POS_TRG_TYPE_MASK)
#define MMC_CR_INI_POS_TRG_TYPE_GET(x) (((uint32_t)(x) & MMC_CR_INI_POS_TRG_TYPE_MASK) >> MMC_CR_INI_POS_TRG_TYPE_SHIFT)

/*
 * INI_DELTA_POS_CMD_MSK (RW)
 *
 * 1: change
 * 0: won't change
 * bit 3: for delta accel
 * bit 2: for delta speed
 * bit 1: for delta revolution
 * bit 0: for delta position
 */
#define MMC_CR_INI_DELTA_POS_CMD_MSK_MASK (0xF0000UL)
#define MMC_CR_INI_DELTA_POS_CMD_MSK_SHIFT (16U)
#define MMC_CR_INI_DELTA_POS_CMD_MSK_SET(x) (((uint32_t)(x) << MMC_CR_INI_DELTA_POS_CMD_MSK_SHIFT) & MMC_CR_INI_DELTA_POS_CMD_MSK_MASK)
#define MMC_CR_INI_DELTA_POS_CMD_MSK_GET(x) (((uint32_t)(x) & MMC_CR_INI_DELTA_POS_CMD_MSK_MASK) >> MMC_CR_INI_DELTA_POS_CMD_MSK_SHIFT)

/*
 * INI_DELTA_POS_REQ (RW)
 *
 * 1: Command to reload the delta pos. Auto clear
 * 0:
 */
#define MMC_CR_INI_DELTA_POS_REQ_MASK (0x8000U)
#define MMC_CR_INI_DELTA_POS_REQ_SHIFT (15U)
#define MMC_CR_INI_DELTA_POS_REQ_SET(x) (((uint32_t)(x) << MMC_CR_INI_DELTA_POS_REQ_SHIFT) & MMC_CR_INI_DELTA_POS_REQ_MASK)
#define MMC_CR_INI_DELTA_POS_REQ_GET(x) (((uint32_t)(x) & MMC_CR_INI_DELTA_POS_REQ_MASK) >> MMC_CR_INI_DELTA_POS_REQ_SHIFT)

/*
 * OPEN_LOOP_MODE (RW)
 *
 * 1: in open loop mode
 * 0: not in open loop mode
 */
#define MMC_CR_OPEN_LOOP_MODE_MASK (0x4000U)
#define MMC_CR_OPEN_LOOP_MODE_SHIFT (14U)
#define MMC_CR_OPEN_LOOP_MODE_SET(x) (((uint32_t)(x) << MMC_CR_OPEN_LOOP_MODE_SHIFT) & MMC_CR_OPEN_LOOP_MODE_MASK)
#define MMC_CR_OPEN_LOOP_MODE_GET(x) (((uint32_t)(x) & MMC_CR_OPEN_LOOP_MODE_MASK) >> MMC_CR_OPEN_LOOP_MODE_SHIFT)

/*
 * POS_TYPE (RW)
 *
 * 1: 32-bit for rev+pos, with each element occupying 16 bits
 * 0: 32-bit for rev, and 32 bit for pos
 * When CR[MANUAL_IO]==1,
 * 1: means that the INI_POS is acting as INI_POS cmds
 * 0: means that the INI_POS is simulating the input of iposition and itimestamp
 */
#define MMC_CR_POS_TYPE_MASK (0x2000U)
#define MMC_CR_POS_TYPE_SHIFT (13U)
#define MMC_CR_POS_TYPE_SET(x) (((uint32_t)(x) << MMC_CR_POS_TYPE_SHIFT) & MMC_CR_POS_TYPE_MASK)
#define MMC_CR_POS_TYPE_GET(x) (((uint32_t)(x) & MMC_CR_POS_TYPE_MASK) >> MMC_CR_POS_TYPE_SHIFT)

/*
 * INI_POS_CMD_MSK (RW)
 *
 * 1: change
 * 0: won't change
 * bit 3: for accel
 * bit 2: for speed
 * bit 1: for revolution
 * bit 0: for position
 */
#define MMC_CR_INI_POS_CMD_MSK_MASK (0x1E00U)
#define MMC_CR_INI_POS_CMD_MSK_SHIFT (9U)
#define MMC_CR_INI_POS_CMD_MSK_SET(x) (((uint32_t)(x) << MMC_CR_INI_POS_CMD_MSK_SHIFT) & MMC_CR_INI_POS_CMD_MSK_MASK)
#define MMC_CR_INI_POS_CMD_MSK_GET(x) (((uint32_t)(x) & MMC_CR_INI_POS_CMD_MSK_MASK) >> MMC_CR_INI_POS_CMD_MSK_SHIFT)

/*
 * INI_POS_REQ (RW)
 *
 * 1: Command to reload the positions. Auto clear
 * 0:
 */
#define MMC_CR_INI_POS_REQ_MASK (0x100U)
#define MMC_CR_INI_POS_REQ_SHIFT (8U)
#define MMC_CR_INI_POS_REQ_SET(x) (((uint32_t)(x) << MMC_CR_INI_POS_REQ_SHIFT) & MMC_CR_INI_POS_REQ_MASK)
#define MMC_CR_INI_POS_REQ_GET(x) (((uint32_t)(x) & MMC_CR_INI_POS_REQ_MASK) >> MMC_CR_INI_POS_REQ_SHIFT)

/*
 * INI_COEFS_CMD_MSK (RW)
 *
 * 1: change
 * 0: won't change
 * bit 2: for ACOEF
 * bit 1: for ICOEF
 * bit 0: for PCOEF
 */
#define MMC_CR_INI_COEFS_CMD_MSK_MASK (0xE0U)
#define MMC_CR_INI_COEFS_CMD_MSK_SHIFT (5U)
#define MMC_CR_INI_COEFS_CMD_MSK_SET(x) (((uint32_t)(x) << MMC_CR_INI_COEFS_CMD_MSK_SHIFT) & MMC_CR_INI_COEFS_CMD_MSK_MASK)
#define MMC_CR_INI_COEFS_CMD_MSK_GET(x) (((uint32_t)(x) & MMC_CR_INI_COEFS_CMD_MSK_MASK) >> MMC_CR_INI_COEFS_CMD_MSK_SHIFT)

