RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM5300/ip/hpm_mmc_regs.h
/*
 * INI_COEFS_CMD (RW)
 *
 * 1: Command to reload the coefs. Auto clear
 * 0:
 */
#define MMC_CR_INI_COEFS_CMD_MASK (0x10U)
#define MMC_CR_INI_COEFS_CMD_SHIFT (4U)
#define MMC_CR_INI_COEFS_CMD_SET(x) (((uint32_t)(x) << MMC_CR_INI_COEFS_CMD_SHIFT) & MMC_CR_INI_COEFS_CMD_MASK)
#define MMC_CR_INI_COEFS_CMD_GET(x) (((uint32_t)(x) & MMC_CR_INI_COEFS_CMD_MASK) >> MMC_CR_INI_COEFS_CMD_SHIFT)

/*
 * SHADOW_RD_REQ (RW)
 *
 * 1: Shadow Request for read of tracking parameters. Auto clear
 * 0:
 */
#define MMC_CR_SHADOW_RD_REQ_MASK (0x8U)
#define MMC_CR_SHADOW_RD_REQ_SHIFT (3U)
#define MMC_CR_SHADOW_RD_REQ_SET(x) (((uint32_t)(x) << MMC_CR_SHADOW_RD_REQ_SHIFT) & MMC_CR_SHADOW_RD_REQ_MASK)
#define MMC_CR_SHADOW_RD_REQ_GET(x) (((uint32_t)(x) & MMC_CR_SHADOW_RD_REQ_MASK) >> MMC_CR_SHADOW_RD_REQ_SHIFT)

/*
 * ADJOP (RW)
 *
 * 1: use the input iposition whenever a new iposition comes, and force the predicted output stop at the boundaries.
 * 0: Continuous tracking mode, without any boundary check
 */
#define MMC_CR_ADJOP_MASK (0x4U)
#define MMC_CR_ADJOP_SHIFT (2U)
#define MMC_CR_ADJOP_SET(x) (((uint32_t)(x) << MMC_CR_ADJOP_SHIFT) & MMC_CR_ADJOP_MASK)
#define MMC_CR_ADJOP_GET(x) (((uint32_t)(x) & MMC_CR_ADJOP_MASK) >> MMC_CR_ADJOP_SHIFT)

/*
 * DISCRETETRC (RW)
 *
 * 1: Discrete position input
 * 0: Continuous position input
 */
#define MMC_CR_DISCRETETRC_MASK (0x2U)
#define MMC_CR_DISCRETETRC_SHIFT (1U)
#define MMC_CR_DISCRETETRC_SET(x) (((uint32_t)(x) << MMC_CR_DISCRETETRC_SHIFT) & MMC_CR_DISCRETETRC_MASK)
#define MMC_CR_DISCRETETRC_GET(x) (((uint32_t)(x) & MMC_CR_DISCRETETRC_MASK) >> MMC_CR_DISCRETETRC_SHIFT)

/*
 * MOD_EN (RW)
 *
 * Module Enable
 */
#define MMC_CR_MOD_EN_MASK (0x1U)
#define MMC_CR_MOD_EN_SHIFT (0U)
#define MMC_CR_MOD_EN_SET(x) (((uint32_t)(x) << MMC_CR_MOD_EN_SHIFT) & MMC_CR_MOD_EN_MASK)
#define MMC_CR_MOD_EN_GET(x) (((uint32_t)(x) & MMC_CR_MOD_EN_MASK) >> MMC_CR_MOD_EN_SHIFT)

/* Bitfield definition for register: STA */
/*
 * ERR_ID (RO)
 *
 * Tracking ERR_ID
 */
#define MMC_STA_ERR_ID_MASK (0xF0000000UL)
#define MMC_STA_ERR_ID_SHIFT (28U)
#define MMC_STA_ERR_ID_GET(x) (((uint32_t)(x) & MMC_STA_ERR_ID_MASK) >> MMC_STA_ERR_ID_SHIFT)

/*
 * SPEED_TRG_VALID (W1C)
 *
 * W1C
 */
#define MMC_STA_SPEED_TRG_VALID_MASK (0x400U)
#define MMC_STA_SPEED_TRG_VALID_SHIFT (10U)
#define MMC_STA_SPEED_TRG_VALID_SET(x) (((uint32_t)(x) << MMC_STA_SPEED_TRG_VALID_SHIFT) & MMC_STA_SPEED_TRG_VALID_MASK)
#define MMC_STA_SPEED_TRG_VALID_GET(x) (((uint32_t)(x) & MMC_STA_SPEED_TRG_VALID_MASK) >> MMC_STA_SPEED_TRG_VALID_SHIFT)

/*
 * POS_TRG_VALID (W1C)
 *
 * W1C
 */
#define MMC_STA_POS_TRG_VALID_MASK (0x200U)
#define MMC_STA_POS_TRG_VALID_SHIFT (9U)
#define MMC_STA_POS_TRG_VALID_SET(x) (((uint32_t)(x) << MMC_STA_POS_TRG_VALID_SHIFT) & MMC_STA_POS_TRG_VALID_MASK)
#define MMC_STA_POS_TRG_VALID_GET(x) (((uint32_t)(x) & MMC_STA_POS_TRG_VALID_MASK) >> MMC_STA_POS_TRG_VALID_SHIFT)

/*
 * INI_DELTA_POS_REQ_CMD_DONE (W1C)
 *
 * W1C
 */
#define MMC_STA_INI_DELTA_POS_REQ_CMD_DONE_MASK (0x100U)
#define MMC_STA_INI_DELTA_POS_REQ_CMD_DONE_SHIFT (8U)
#define MMC_STA_INI_DELTA_POS_REQ_CMD_DONE_SET(x) (((uint32_t)(x) << MMC_STA_INI_DELTA_POS_REQ_CMD_DONE_SHIFT) & MMC_STA_INI_DELTA_POS_REQ_CMD_DONE_MASK)
#define MMC_STA_INI_DELTA_POS_REQ_CMD_DONE_GET(x) (((uint32_t)(x) & MMC_STA_INI_DELTA_POS_REQ_CMD_DONE_MASK) >> MMC_STA_INI_DELTA_POS_REQ_CMD_DONE_SHIFT)

/*
 * INI_BR0_POS_REQ_CMD_DONE (W1C)
 *
 * W1C
 */
#define MMC_STA_INI_BR0_POS_REQ_CMD_DONE_MASK (0x80U)
#define MMC_STA_INI_BR0_POS_REQ_CMD_DONE_SHIFT (7U)
#define MMC_STA_INI_BR0_POS_REQ_CMD_DONE_SET(x) (((uint32_t)(x) << MMC_STA_INI_BR0_POS_REQ_CMD_DONE_SHIFT) & MMC_STA_INI_BR0_POS_REQ_CMD_DONE_MASK)
#define MMC_STA_INI_BR0_POS_REQ_CMD_DONE_GET(x) (((uint32_t)(x) & MMC_STA_INI_BR0_POS_REQ_CMD_DONE_MASK) >> MMC_STA_INI_BR0_POS_REQ_CMD_DONE_SHIFT)

/*
 * INI_BR1_POS_REQ_CMD_DONE (W1C)
 *
 * W1C
 */
#define MMC_STA_INI_BR1_POS_REQ_CMD_DONE_MASK (0x40U)
#define MMC_STA_INI_BR1_POS_REQ_CMD_DONE_SHIFT (6U)
#define MMC_STA_INI_BR1_POS_REQ_CMD_DONE_SET(x) (((uint32_t)(x) << MMC_STA_INI_BR1_POS_REQ_CMD_DONE_SHIFT) & MMC_STA_INI_BR1_POS_REQ_CMD_DONE_MASK)
#define MMC_STA_INI_BR1_POS_REQ_CMD_DONE_GET(x) (((uint32_t)(x) & MMC_STA_INI_BR1_POS_REQ_CMD_DONE_MASK) >> MMC_STA_INI_BR1_POS_REQ_CMD_DONE_SHIFT)

/*
 * IDLE (RO)
 *
 * Tracking Module in Idle status
 */
#define MMC_STA_IDLE_MASK (0x20U)
#define MMC_STA_IDLE_SHIFT (5U)
#define MMC_STA_IDLE_GET(x) (((uint32_t)(x) & MMC_STA_IDLE_MASK) >> MMC_STA_IDLE_SHIFT)

/*
 * OOSYNC (W1C)
 *
 * Tracking module out-of sync. W1C
 */
#define MMC_STA_OOSYNC_MASK (0x10U)
#define MMC_STA_OOSYNC_SHIFT (4U)
#define MMC_STA_OOSYNC_SET(x) (((uint32_t)(x) << MMC_STA_OOSYNC_SHIFT) & MMC_STA_OOSYNC_MASK)
#define MMC_STA_OOSYNC_GET(x) (((uint32_t)(x) & MMC_STA_OOSYNC_MASK) >> MMC_STA_OOSYNC_SHIFT)

/*
 * INI_POS_REQ_CMD_DONE (W1C)
 *
 * W1C
 */
#define MMC_STA_INI_POS_REQ_CMD_DONE_MASK (0x4U)
#define MMC_STA_INI_POS_REQ_CMD_DONE_SHIFT (2U)
#define MMC_STA_INI_POS_REQ_CMD_DONE_SET(x) (((uint32_t)(x) << MMC_STA_INI_POS_REQ_CMD_DONE_SHIFT) & MMC_STA_INI_POS_REQ_CMD_DONE_MASK)
#define MMC_STA_INI_POS_REQ_CMD_DONE_GET(x) (((uint32_t)(x) & MMC_STA_INI_POS_REQ_CMD_DONE_MASK) >> MMC_STA_INI_POS_REQ_CMD_DONE_SHIFT)

/*
 * INI_COEFS_CMD_DONE (W1C)
 *
 * W1C
 */
#define MMC_STA_INI_COEFS_CMD_DONE_MASK (0x2U)
#define MMC_STA_INI_COEFS_CMD_DONE_SHIFT (1U)
#define MMC_STA_INI_COEFS_CMD_DONE_SET(x) (((uint32_t)(x) << MMC_STA_INI_COEFS_CMD_DONE_SHIFT) & MMC_STA_INI_COEFS_CMD_DONE_MASK)
#define MMC_STA_INI_COEFS_CMD_DONE_GET(x) (((uint32_t)(x) & MMC_STA_INI_COEFS_CMD_DONE_MASK) >> MMC_STA_INI_COEFS_CMD_DONE_SHIFT)

/*
 * SHADOW_RD_DONE (RO)
 *
 * Shadow ready for read. Auto cleared by setting CR[SHADOW_RD_REQ] as 1
 */
#define MMC_STA_SHADOW_RD_DONE_MASK (0x1U)
#define MMC_STA_SHADOW_RD_DONE_SHIFT (0U)
#define MMC_STA_SHADOW_RD_DONE_GET(x) (((uint32_t)(x) & MMC_STA_SHADOW_RD_DONE_MASK) >> MMC_STA_SHADOW_RD_DONE_SHIFT)

/* Bitfield definition for register: INT_EN */
/*
 * SPEED_TRG_VLD_IE (RW)
 *
 * Interrupt Enable for SPEED_TRG_VALID
 */
#define MMC_INT_EN_SPEED_TRG_VLD_IE_MASK (0x400U)
#define MMC_INT_EN_SPEED_TRG_VLD_IE_SHIFT (10U)
#define MMC_INT_EN_SPEED_TRG_VLD_IE_SET(x) (((uint32_t)(x) << MMC_INT_EN_SPEED_TRG_VLD_IE_SHIFT) & MMC_INT_EN_SPEED_TRG_VLD_IE_MASK)
#define MMC_INT_EN_SPEED_TRG_VLD_IE_GET(x) (((uint32_t)(x) & MMC_INT_EN_SPEED_TRG_VLD_IE_MASK) >> MMC_INT_EN_SPEED_TRG_VLD_IE_SHIFT)

