RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM5300/ip/hpm_mmc_regs.h
/*
 * BR_EN (RW)
 *
 * Branch Enable
 */
#define MMC_BR_BR_CTRL_BR_EN_MASK (0x1U)
#define MMC_BR_BR_CTRL_BR_EN_SHIFT (0U)
#define MMC_BR_BR_CTRL_BR_EN_SET(x) (((uint32_t)(x) << MMC_BR_BR_CTRL_BR_EN_SHIFT) & MMC_BR_BR_CTRL_BR_EN_MASK)
#define MMC_BR_BR_CTRL_BR_EN_GET(x) (((uint32_t)(x) & MMC_BR_BR_CTRL_BR_EN_MASK) >> MMC_BR_BR_CTRL_BR_EN_SHIFT)

/* Bitfield definition for register of struct array BR: BR_TIMEOFF */
/*
 * VAL (RW)
 *
 * ufix<32, 0> time offset incycles from the trigger time
 */
#define MMC_BR_BR_TIMEOFF_VAL_MASK (0xFFFFFFFFUL)
#define MMC_BR_BR_TIMEOFF_VAL_SHIFT (0U)
#define MMC_BR_BR_TIMEOFF_VAL_SET(x) (((uint32_t)(x) << MMC_BR_BR_TIMEOFF_VAL_SHIFT) & MMC_BR_BR_TIMEOFF_VAL_MASK)
#define MMC_BR_BR_TIMEOFF_VAL_GET(x) (((uint32_t)(x) & MMC_BR_BR_TIMEOFF_VAL_MASK) >> MMC_BR_BR_TIMEOFF_VAL_SHIFT)

/* Bitfield definition for register of struct array BR: BR_TRG_PERIOD */
/*
 * VAL (RW)
 *
 * uifx<32, 0>, time offset incycles between each trigger time
 */
#define MMC_BR_BR_TRG_PERIOD_VAL_MASK (0xFFFFFFFFUL)
#define MMC_BR_BR_TRG_PERIOD_VAL_SHIFT (0U)
#define MMC_BR_BR_TRG_PERIOD_VAL_SET(x) (((uint32_t)(x) << MMC_BR_BR_TRG_PERIOD_VAL_SHIFT) & MMC_BR_BR_TRG_PERIOD_VAL_MASK)
#define MMC_BR_BR_TRG_PERIOD_VAL_GET(x) (((uint32_t)(x) & MMC_BR_BR_TRG_PERIOD_VAL_MASK) >> MMC_BR_BR_TRG_PERIOD_VAL_SHIFT)

/* Bitfield definition for register of struct array BR: BR_TRG_F_TIME */
/*
 * VAL (RW)
 *
 * uifx<32, 0> the time for the first trigger
 */
#define MMC_BR_BR_TRG_F_TIME_VAL_MASK (0xFFFFFFFFUL)
#define MMC_BR_BR_TRG_F_TIME_VAL_SHIFT (0U)
#define MMC_BR_BR_TRG_F_TIME_VAL_SET(x) (((uint32_t)(x) << MMC_BR_BR_TRG_F_TIME_VAL_SHIFT) & MMC_BR_BR_TRG_F_TIME_VAL_MASK)
#define MMC_BR_BR_TRG_F_TIME_VAL_GET(x) (((uint32_t)(x) & MMC_BR_BR_TRG_F_TIME_VAL_MASK) >> MMC_BR_BR_TRG_F_TIME_VAL_SHIFT)

/* Bitfield definition for register of struct array BR: BR_ST */
/*
 * OPEN_LOOP_ST (RO)
 *
 * 1：in open loop mode
 * 0：in closed loop mode
 */
#define MMC_BR_BR_ST_OPEN_LOOP_ST_MASK (0x400U)
#define MMC_BR_BR_ST_OPEN_LOOP_ST_SHIFT (10U)
#define MMC_BR_BR_ST_OPEN_LOOP_ST_GET(x) (((uint32_t)(x) & MMC_BR_BR_ST_OPEN_LOOP_ST_MASK) >> MMC_BR_BR_ST_OPEN_LOOP_ST_SHIFT)

/*
 * SPEED_TRG_VLD (W1C)
 *
 * 1：self speed trigger event found
 * 0：self speed trigger event not found yet
 */
#define MMC_BR_BR_ST_SPEED_TRG_VLD_MASK (0x200U)
#define MMC_BR_BR_ST_SPEED_TRG_VLD_SHIFT (9U)
#define MMC_BR_BR_ST_SPEED_TRG_VLD_SET(x) (((uint32_t)(x) << MMC_BR_BR_ST_SPEED_TRG_VLD_SHIFT) & MMC_BR_BR_ST_SPEED_TRG_VLD_MASK)
#define MMC_BR_BR_ST_SPEED_TRG_VLD_GET(x) (((uint32_t)(x) & MMC_BR_BR_ST_SPEED_TRG_VLD_MASK) >> MMC_BR_BR_ST_SPEED_TRG_VLD_SHIFT)

/*
 * POS_TRG_VLD (W1C)
 *
 * 1：self position trigger event found
 * 0：self position trigger event not found yet
 */
#define MMC_BR_BR_ST_POS_TRG_VLD_MASK (0x100U)
#define MMC_BR_BR_ST_POS_TRG_VLD_SHIFT (8U)
#define MMC_BR_BR_ST_POS_TRG_VLD_SET(x) (((uint32_t)(x) << MMC_BR_BR_ST_POS_TRG_VLD_SHIFT) & MMC_BR_BR_ST_POS_TRG_VLD_MASK)
#define MMC_BR_BR_ST_POS_TRG_VLD_GET(x) (((uint32_t)(x) & MMC_BR_BR_ST_POS_TRG_VLD_MASK) >> MMC_BR_BR_ST_POS_TRG_VLD_SHIFT)

/*
 * INI_DELTA_POS_DONE (W1C)
 *
 * 1: the initialization of delta position command is done
 * 0: the initialization of delta position command is not done
 */
#define MMC_BR_BR_ST_INI_DELTA_POS_DONE_MASK (0x40U)
#define MMC_BR_BR_ST_INI_DELTA_POS_DONE_SHIFT (6U)
#define MMC_BR_BR_ST_INI_DELTA_POS_DONE_SET(x) (((uint32_t)(x) << MMC_BR_BR_ST_INI_DELTA_POS_DONE_SHIFT) & MMC_BR_BR_ST_INI_DELTA_POS_DONE_MASK)
#define MMC_BR_BR_ST_INI_DELTA_POS_DONE_GET(x) (((uint32_t)(x) & MMC_BR_BR_ST_INI_DELTA_POS_DONE_MASK) >> MMC_BR_BR_ST_INI_DELTA_POS_DONE_SHIFT)

/*
 * IDLE (RO)
 *
 * 1: The prediction module is idle.
 * 0: The prediction module is not idle.
 */
#define MMC_BR_BR_ST_IDLE_MASK (0x20U)
#define MMC_BR_BR_ST_IDLE_SHIFT (5U)
#define MMC_BR_BR_ST_IDLE_GET(x) (((uint32_t)(x) & MMC_BR_BR_ST_IDLE_MASK) >> MMC_BR_BR_ST_IDLE_SHIFT)

/*
 * ERR_ID (RO)
 *
 * The module's error ID output
 */
#define MMC_BR_BR_ST_ERR_ID_MASK (0xFU)
#define MMC_BR_BR_ST_ERR_ID_SHIFT (0U)
#define MMC_BR_BR_ST_ERR_ID_GET(x) (((uint32_t)(x) & MMC_BR_BR_ST_ERR_ID_MASK) >> MMC_BR_BR_ST_ERR_ID_SHIFT)

/* Bitfield definition for register of struct array BR: BR_TRG_POS_CFG */
/*
 * EDGE (RW)
 *
 * bit1: 0: (rising edge) pos inc greater than, 1: (falling edge)  pos dec less than
 */
#define MMC_BR_BR_TRG_POS_CFG_EDGE_MASK (0x2U)
#define MMC_BR_BR_TRG_POS_CFG_EDGE_SHIFT (1U)
#define MMC_BR_BR_TRG_POS_CFG_EDGE_SET(x) (((uint32_t)(x) << MMC_BR_BR_TRG_POS_CFG_EDGE_SHIFT) & MMC_BR_BR_TRG_POS_CFG_EDGE_MASK)
#define MMC_BR_BR_TRG_POS_CFG_EDGE_GET(x) (((uint32_t)(x) & MMC_BR_BR_TRG_POS_CFG_EDGE_MASK) >> MMC_BR_BR_TRG_POS_CFG_EDGE_SHIFT)

/*
 * EN (RW)
 *
 * 1-trigger valid; 0-Trigger not valid
 */
#define MMC_BR_BR_TRG_POS_CFG_EN_MASK (0x1U)
#define MMC_BR_BR_TRG_POS_CFG_EN_SHIFT (0U)
#define MMC_BR_BR_TRG_POS_CFG_EN_SET(x) (((uint32_t)(x) << MMC_BR_BR_TRG_POS_CFG_EN_SHIFT) & MMC_BR_BR_TRG_POS_CFG_EN_MASK)
#define MMC_BR_BR_TRG_POS_CFG_EN_GET(x) (((uint32_t)(x) & MMC_BR_BR_TRG_POS_CFG_EN_MASK) >> MMC_BR_BR_TRG_POS_CFG_EN_SHIFT)

/* Bitfield definition for register of struct array BR: BR_TRG_POS_THR */
/*
 * VAL (RW)
 *
 * For pos out trigger (pos).
 * ufix<32, 32>
 */
#define MMC_BR_BR_TRG_POS_THR_VAL_MASK (0xFFFFFFFFUL)
#define MMC_BR_BR_TRG_POS_THR_VAL_SHIFT (0U)
#define MMC_BR_BR_TRG_POS_THR_VAL_SET(x) (((uint32_t)(x) << MMC_BR_BR_TRG_POS_THR_VAL_SHIFT) & MMC_BR_BR_TRG_POS_THR_VAL_MASK)
#define MMC_BR_BR_TRG_POS_THR_VAL_GET(x) (((uint32_t)(x) & MMC_BR_BR_TRG_POS_THR_VAL_MASK) >> MMC_BR_BR_TRG_POS_THR_VAL_SHIFT)

/* Bitfield definition for register of struct array BR: BR_TRG_REV_THR */
/*
 * VAL (RW)
 *
 * For pos out trigger (rev)
 * ufix<32, 0>
 */
#define MMC_BR_BR_TRG_REV_THR_VAL_MASK (0xFFFFFFFFUL)
#define MMC_BR_BR_TRG_REV_THR_VAL_SHIFT (0U)
#define MMC_BR_BR_TRG_REV_THR_VAL_SET(x) (((uint32_t)(x) << MMC_BR_BR_TRG_REV_THR_VAL_SHIFT) & MMC_BR_BR_TRG_REV_THR_VAL_MASK)
#define MMC_BR_BR_TRG_REV_THR_VAL_GET(x) (((uint32_t)(x) & MMC_BR_BR_TRG_REV_THR_VAL_MASK) >> MMC_BR_BR_TRG_REV_THR_VAL_SHIFT)

/* Bitfield definition for register of struct array BR: BR_TRG_SPEED_CFG */
/*
 * COMP_TYPE (RW)
 *
 * Use abs value for comparion. 0: Use the speed with direction info (so not the abs value)
 */
#define MMC_BR_BR_TRG_SPEED_CFG_COMP_TYPE_MASK (0x4U)
#define MMC_BR_BR_TRG_SPEED_CFG_COMP_TYPE_SHIFT (2U)
#define MMC_BR_BR_TRG_SPEED_CFG_COMP_TYPE_SET(x) (((uint32_t)(x) << MMC_BR_BR_TRG_SPEED_CFG_COMP_TYPE_SHIFT) & MMC_BR_BR_TRG_SPEED_CFG_COMP_TYPE_MASK)
#define MMC_BR_BR_TRG_SPEED_CFG_COMP_TYPE_GET(x) (((uint32_t)(x) & MMC_BR_BR_TRG_SPEED_CFG_COMP_TYPE_MASK) >> MMC_BR_BR_TRG_SPEED_CFG_COMP_TYPE_SHIFT)

