RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM5300/ip/hpm_mmc_regs.h
/*
 * EDGE_SEL (RW)
 *
 * 0: (rising edge) speed inc greater than, 1: (falling edge)  speed dec less than
 */
#define MMC_BR_BR_TRG_SPEED_CFG_EDGE_SEL_MASK (0x2U)
#define MMC_BR_BR_TRG_SPEED_CFG_EDGE_SEL_SHIFT (1U)
#define MMC_BR_BR_TRG_SPEED_CFG_EDGE_SEL_SET(x) (((uint32_t)(x) << MMC_BR_BR_TRG_SPEED_CFG_EDGE_SEL_SHIFT) & MMC_BR_BR_TRG_SPEED_CFG_EDGE_SEL_MASK)
#define MMC_BR_BR_TRG_SPEED_CFG_EDGE_SEL_GET(x) (((uint32_t)(x) & MMC_BR_BR_TRG_SPEED_CFG_EDGE_SEL_MASK) >> MMC_BR_BR_TRG_SPEED_CFG_EDGE_SEL_SHIFT)

/*
 * EN (RW)
 *
 * 1-trigger valid; 0-Trigger not valid
 * Normally it means either the max pos speed, or the min negative speed.
 */
#define MMC_BR_BR_TRG_SPEED_CFG_EN_MASK (0x1U)
#define MMC_BR_BR_TRG_SPEED_CFG_EN_SHIFT (0U)
#define MMC_BR_BR_TRG_SPEED_CFG_EN_SET(x) (((uint32_t)(x) << MMC_BR_BR_TRG_SPEED_CFG_EN_SHIFT) & MMC_BR_BR_TRG_SPEED_CFG_EN_MASK)
#define MMC_BR_BR_TRG_SPEED_CFG_EN_GET(x) (((uint32_t)(x) & MMC_BR_BR_TRG_SPEED_CFG_EN_MASK) >> MMC_BR_BR_TRG_SPEED_CFG_EN_SHIFT)

/* Bitfield definition for register of struct array BR: BR_TRG_SPEED_THR */
/*
 * VAL (RW)
 *
 * For speed trigger.
 * continuous mode: fix<32, 19>
 */
#define MMC_BR_BR_TRG_SPEED_THR_VAL_MASK (0xFFFFFFFFUL)
#define MMC_BR_BR_TRG_SPEED_THR_VAL_SHIFT (0U)
#define MMC_BR_BR_TRG_SPEED_THR_VAL_SET(x) (((uint32_t)(x) << MMC_BR_BR_TRG_SPEED_THR_VAL_SHIFT) & MMC_BR_BR_TRG_SPEED_THR_VAL_MASK)
#define MMC_BR_BR_TRG_SPEED_THR_VAL_GET(x) (((uint32_t)(x) & MMC_BR_BR_TRG_SPEED_THR_VAL_MASK) >> MMC_BR_BR_TRG_SPEED_THR_VAL_SHIFT)

/* Bitfield definition for register of struct array BR: BR_INI_POS_TIME */
/*
 * VAL (RW)
 *
 * indicate the time to change the values.
 * 0: instant change
 */
#define MMC_BR_BR_INI_POS_TIME_VAL_MASK (0xFFFFFFFFUL)
#define MMC_BR_BR_INI_POS_TIME_VAL_SHIFT (0U)
#define MMC_BR_BR_INI_POS_TIME_VAL_SET(x) (((uint32_t)(x) << MMC_BR_BR_INI_POS_TIME_VAL_SHIFT) & MMC_BR_BR_INI_POS_TIME_VAL_MASK)
#define MMC_BR_BR_INI_POS_TIME_VAL_GET(x) (((uint32_t)(x) & MMC_BR_BR_INI_POS_TIME_VAL_MASK) >> MMC_BR_BR_INI_POS_TIME_VAL_SHIFT)

/* Bitfield definition for register of struct array BR: BR_INI_POS */
/*
 * VAL (RW)
 *
 * the value
 * ufix<32, 32>
 */
#define MMC_BR_BR_INI_POS_VAL_MASK (0xFFFFFFFFUL)
#define MMC_BR_BR_INI_POS_VAL_SHIFT (0U)
#define MMC_BR_BR_INI_POS_VAL_SET(x) (((uint32_t)(x) << MMC_BR_BR_INI_POS_VAL_SHIFT) & MMC_BR_BR_INI_POS_VAL_MASK)
#define MMC_BR_BR_INI_POS_VAL_GET(x) (((uint32_t)(x) & MMC_BR_BR_INI_POS_VAL_MASK) >> MMC_BR_BR_INI_POS_VAL_SHIFT)

/* Bitfield definition for register of struct array BR: BR_INI_REV */
/*
 * VAL (RW)
 *
 * the value
 * ufix<32, 0>
 */
#define MMC_BR_BR_INI_REV_VAL_MASK (0xFFFFFFFFUL)
#define MMC_BR_BR_INI_REV_VAL_SHIFT (0U)
#define MMC_BR_BR_INI_REV_VAL_SET(x) (((uint32_t)(x) << MMC_BR_BR_INI_REV_VAL_SHIFT) & MMC_BR_BR_INI_REV_VAL_MASK)
#define MMC_BR_BR_INI_REV_VAL_GET(x) (((uint32_t)(x) & MMC_BR_BR_INI_REV_VAL_MASK) >> MMC_BR_BR_INI_REV_VAL_SHIFT)

/* Bitfield definition for register of struct array BR: BR_INI_SPEED */
/*
 * VAL (RW)
 *
 * the value
 * fix<32, 19>
 */
#define MMC_BR_BR_INI_SPEED_VAL_MASK (0xFFFFFFFFUL)
#define MMC_BR_BR_INI_SPEED_VAL_SHIFT (0U)
#define MMC_BR_BR_INI_SPEED_VAL_SET(x) (((uint32_t)(x) << MMC_BR_BR_INI_SPEED_VAL_SHIFT) & MMC_BR_BR_INI_SPEED_VAL_MASK)
#define MMC_BR_BR_INI_SPEED_VAL_GET(x) (((uint32_t)(x) & MMC_BR_BR_INI_SPEED_VAL_MASK) >> MMC_BR_BR_INI_SPEED_VAL_SHIFT)

/* Bitfield definition for register of struct array BR: BR_INI_ACCEL */
/*
 * VAL (RW)
 *
 * the value
 * continuous mode: fix<32, 19>
 */
#define MMC_BR_BR_INI_ACCEL_VAL_MASK (0xFFFFFFFFUL)
#define MMC_BR_BR_INI_ACCEL_VAL_SHIFT (0U)
#define MMC_BR_BR_INI_ACCEL_VAL_SET(x) (((uint32_t)(x) << MMC_BR_BR_INI_ACCEL_VAL_SHIFT) & MMC_BR_BR_INI_ACCEL_VAL_MASK)
#define MMC_BR_BR_INI_ACCEL_VAL_GET(x) (((uint32_t)(x) & MMC_BR_BR_INI_ACCEL_VAL_MASK) >> MMC_BR_BR_INI_ACCEL_VAL_SHIFT)

/* Bitfield definition for register of struct array BR: BR_INI_DELTA_POS_TIME */
/*
 * VAL (RW)
 *
 * indicate the time to change the values.
 * 0: instant change
 */
#define MMC_BR_BR_INI_DELTA_POS_TIME_VAL_MASK (0xFFFFFFFFUL)
#define MMC_BR_BR_INI_DELTA_POS_TIME_VAL_SHIFT (0U)
#define MMC_BR_BR_INI_DELTA_POS_TIME_VAL_SET(x) (((uint32_t)(x) << MMC_BR_BR_INI_DELTA_POS_TIME_VAL_SHIFT) & MMC_BR_BR_INI_DELTA_POS_TIME_VAL_MASK)
#define MMC_BR_BR_INI_DELTA_POS_TIME_VAL_GET(x) (((uint32_t)(x) & MMC_BR_BR_INI_DELTA_POS_TIME_VAL_MASK) >> MMC_BR_BR_INI_DELTA_POS_TIME_VAL_SHIFT)

/* Bitfield definition for register of struct array BR: BR_INI_DELTA_POS */
/*
 * VAL (RW)
 *
 * the value
 * continuous mode: ufix<32, 32>
 */
#define MMC_BR_BR_INI_DELTA_POS_VAL_MASK (0xFFFFFFFFUL)
#define MMC_BR_BR_INI_DELTA_POS_VAL_SHIFT (0U)
#define MMC_BR_BR_INI_DELTA_POS_VAL_SET(x) (((uint32_t)(x) << MMC_BR_BR_INI_DELTA_POS_VAL_SHIFT) & MMC_BR_BR_INI_DELTA_POS_VAL_MASK)
#define MMC_BR_BR_INI_DELTA_POS_VAL_GET(x) (((uint32_t)(x) & MMC_BR_BR_INI_DELTA_POS_VAL_MASK) >> MMC_BR_BR_INI_DELTA_POS_VAL_SHIFT)

/* Bitfield definition for register of struct array BR: BR_INI_DELTA_REV */
/*
 * VAL (RW)
 *
 * the value
 * continuous mode: fix<32, 0>
 */
#define MMC_BR_BR_INI_DELTA_REV_VAL_MASK (0xFFFFFFFFUL)
#define MMC_BR_BR_INI_DELTA_REV_VAL_SHIFT (0U)
#define MMC_BR_BR_INI_DELTA_REV_VAL_SET(x) (((uint32_t)(x) << MMC_BR_BR_INI_DELTA_REV_VAL_SHIFT) & MMC_BR_BR_INI_DELTA_REV_VAL_MASK)
#define MMC_BR_BR_INI_DELTA_REV_VAL_GET(x) (((uint32_t)(x) & MMC_BR_BR_INI_DELTA_REV_VAL_MASK) >> MMC_BR_BR_INI_DELTA_REV_VAL_SHIFT)

/* Bitfield definition for register of struct array BR: BR_INI_DELTA_SPEED */
/*
 * VAL (RW)
 *
 * the value
 * continuous mode: fix<32, 19>
 */
#define MMC_BR_BR_INI_DELTA_SPEED_VAL_MASK (0xFFFFFFFFUL)
#define MMC_BR_BR_INI_DELTA_SPEED_VAL_SHIFT (0U)
#define MMC_BR_BR_INI_DELTA_SPEED_VAL_SET(x) (((uint32_t)(x) << MMC_BR_BR_INI_DELTA_SPEED_VAL_SHIFT) & MMC_BR_BR_INI_DELTA_SPEED_VAL_MASK)
#define MMC_BR_BR_INI_DELTA_SPEED_VAL_GET(x) (((uint32_t)(x) & MMC_BR_BR_INI_DELTA_SPEED_VAL_MASK) >> MMC_BR_BR_INI_DELTA_SPEED_VAL_SHIFT)

